Repository: AsimKhan2019/AdventureWork-Demo
Catalog: Jamuro.AdventureWorks.SimpleDemo/Jamuro.AdventureWorks.Resources/Labels.*.resx
Languages: es_es

source: Affected by N+1 Problem
es_es: Afectada por problema de rendimiento N+1

source: All Bikes
es_es: Todas las Bicicletas

source: All Products
es_es: Todos los Productos

source: and
es_es: y

# AvoidN1ProblemWithIncludes
source: Avoid N+1 Problem by using "Includes"
es_es: Evita típico problema N+1 por medio de "Includes"

# BadPractiseForCheckingExistence
source: Affected by bad practice to check pre-existence of rows
es_es: Afectado por uso ineficiente de chequeo de existencia de registros

source: Bikes
es_es: Bicicletas

source: Comments
es_es: Comentarios

source: Home
es_es: Inicio

source: Most Expensive Bikes
es_es: Bicicletas más Caras

# NotAffectedForCheckingExistence
source: Not affected when checking pre-existence of rows
es_es: Chequeo de existencia de registros eficiente

source: No Tracking
es_es: Sin Tracking

source: Number
es_es: Número

source: Price
es_es: Precio

# SelectOnlySqlEmployedFields
source: Select only SQL fields that are employed in business model
es_es: Select sólo con campos SQL empleados en los modelos conceptuales de negocio

source: Skip Tracking
es_es: No uso de Tracking

source: With Includes
es_es: Con "Includes"

# AllBikesWithCheckAllAnyTitle
source: All Bikes with check for existence by using Any() over all rows
es_es: Bicicletas con chequeo de existencia con Any() sobre todos los registros

# AllBikesWithCheckAllCountTitle
source: All Bikes with check for existence by using Count() over all rows
es_es: Bicicletas con chequeo de existencia con Count() sobre todos los registros

# AllBikesWithCheckOneTitle
source: All BIkes with check for existence by retrieving only one record
es_es: Bicicletas con chequeo de existencia basado en primer registro

source: Loading
es_es: Cargando

source: Waiting
es_es: Esperando

# ApplicationSubtitle
source: Application demo by using SQL Server 2016 Adventure Works sample DB, MVC and EF.
es_es: Demo basada en SQL Server 2016 Adventure Works DB, MVC y EF.

source: Background
es_es: Consideraciones

source: External Tools
es_es: Herramientas Externas

source: More Resources
es_es: Más Recursos

source: Overview
es_es: Visión General

source: Technologies
es_es: Tecnologías

# AddIncludes
source: With Includes
es_es: Con "Includes"

# AllBikesWithCheckAnyTitle
source: All Bikes with check for existence by using Any() with filter
es_es: Bicicletas con chequeo de existencia con Any() con filtrado

# AllBikesWithCheckWIthExistsTitle
source: All Bikes with check for existence by using Exists()
es_es: Bicicletas con chequeo de existencia con Exists()

source: Bad
es_es: Mal

source: Best
es_es: Mejor

# Good
source: Bien
es_es: Bueno

source: Help
es_es: Ayuda

source: N+1 Problem
es_es: Problema N+1

source: Restrict SQL Fields
es_es: Restricción de Campos SQL

source: SQL Indexes
es_es: Indices SQL

source: SQL Monitorization
es_es: Monitorización SQL

source: SQL Query Optimization
es_es: Optimización de Consultas SQL

source: SQL Resource Optimization
es_es: Optimización de Resursos SQL

source: Top 10 Most Expensive Bikes
es_es: Top 10 Bicicletas Más Caras

source: Show/Hide Details
es_es: Mostrar/Ocultar Detalles

# SQLReturningOnlyTopBikes
source: SQL returning only top {0} bikes
es_es: SQL devolviendo top {0} de Bicicletas más caras directamente de base de datos

# SQLTopMostExpensiveBikesBadMsg
source: Affected by bad SQL returning all products and then, filtering by {0} most expensive
es_es: Consulta afectada por mala practica SQL que devuelve todas las Bicicletas y después, filtra las 10 más caras

source: For
es_es: Para
